[Killed] BlockStatement
src/services/calculator.service.ts:4:54
 import type { ICalculatorService } from './interfaces/calculator.interface';
 
 export class CalculatorService implements ICalculatorService {
-    async add(a: number, b: number): Promise<number> {
-        return a + b;
-    }
+    async add(a: number, b: number): Promise<number> {}
     async subtract(a: number, b: number): Promise<number> {
         return a - b;
killedBy: CalculatorService should add two numbers correctly
statusReason: expected undefined to be 15 // Object.is equality

[Killed] BlockStatement
src/services/calculator.service.ts:7:59
     async add(a: number, b: number): Promise<number> {
         return a + b;
     }
-    async subtract(a: number, b: number): Promise<number> {
-        return a - b;
-    }
+    async subtract(a: number, b: number): Promise<number> {}
     async multiply(a: number, b: number): Promise<number> {
         return a * b;
killedBy: CalculatorService should subtract two numbers correctly
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/services/calculator.service.ts:8:16
         return a + b;
     }
     async subtract(a: number, b: number): Promise<number> {
-        return a - b;
+        return a + b;
     }
     async multiply(a: number, b: number): Promise<number> {
killedBy: CalculatorService should subtract two numbers correctly
statusReason: expected 15 to be 5 // Object.is equality

[Killed] BlockStatement
src/services/calculator.service.ts:10:59
     async subtract(a: number, b: number): Promise<number> {
         return a - b;
     }
-    async multiply(a: number, b: number): Promise<number> {
-        return a * b;
-    }
+    async multiply(a: number, b: number): Promise<number> {}
     async divide(a: number, b: number): Promise<number> {
         if (b === 0) {
killedBy: CalculatorService should multiply two numbers correctly
statusReason: expected undefined to be 50 // Object.is equality

[Killed] ArithmeticOperator
src/services/calculator.service.ts:11:16
         return a - b;
     }
     async multiply(a: number, b: number): Promise<number> {
-        return a * b;
+        return a / b;
     }
     async divide(a: number, b: number): Promise<number> {
killedBy: CalculatorService should multiply two numbers correctly
statusReason: expected 0.5 to be 50 // Object.is equality

[Killed] BlockStatement
src/services/calculator.service.ts:13:57
     async multiply(a: number, b: number): Promise<number> {
         return a * b;
     }
-    async divide(a: number, b: number): Promise<number> {
-        if (b === 0) {
-            throw new Error("Cannot divide by zero");
-        }
-        return a / b;
-    }
+    async divide(a: number, b: number): Promise<number> {}
 }
 
killedBy: CalculatorService should divide two numbers correctly
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
src/services/calculator.service.ts:14:13
         return a * b;
     }
     async divide(a: number, b: number): Promise<number> {
-        if (b === 0) {
+        if (true) {
             throw new Error("Cannot divide by zero");
         }
killedBy: CalculatorService should divide two numbers correctly
statusReason: Cannot divide by zero

[Killed] BlockStatement
src/services/calculator.service.ts:14:22
         return a * b;
     }
     async divide(a: number, b: number): Promise<number> {
-        if (b === 0) {
-            throw new Error("Cannot divide by zero");
-        }
+        if (b === 0) {}
         return a / b;
     }
killedBy: CalculatorService should throw an error when dividing by zero
statusReason: promise resolved "Infinity" instead of rejecting
