[Killed] BlockStatement
src/services/person.service.ts:4:86
 import type { IPerson, IPersonService } from './interfaces/person.interface';
 
 export class PersonService implements IPersonService {
-    async create(firstName: string, lastName: string, age: number): Promise<IPerson> {
-        if (!firstName || firstName.trim() === "") {
-            throw new Error("First name is required");
-        }
-        if (!lastName || lastName.trim() === "") {
-            throw new Error("Last name is required");
-        }
-        if (firstName.length < 3) {
-            throw new Error("First name must be at least 3 characters long");
-        }
-        if (age < 18) {
-            throw new Error("Person must be of legal age");
-        }
-
-        const fullName = `${firstName} ${lastName}`;
-
-        return {
-            firstName,
-            lastName,
-            age,
-            fullName
-        };
-    }
+    async create(firstName: string, lastName: string, age: number): Promise<IPerson> {}
 }
killedBy: PersonService should create a person correctly
statusReason: Cannot read properties of undefined (reading 'firstName')

[Killed] BlockStatement
src/services/person.service.ts:5:52
 
 export class PersonService implements IPersonService {
     async create(firstName: string, lastName: string, age: number): Promise<IPerson> {
-        if (!firstName || firstName.trim() === "") {
-            throw new Error("First name is required");
-        }
+        if (!firstName || firstName.trim() === "") {}
         if (!lastName || lastName.trim() === "") {
             throw new Error("Last name is required");
killedBy: PersonService should throw an error when first name is empty
statusReason: expected [Function] to throw error including 'First name is required' but got 'First name must be at least 3 charact…'

[Killed] ConditionalExpression
src/services/person.service.ts:5:13
 
 export class PersonService implements IPersonService {
     async create(firstName: string, lastName: string, age: number): Promise<IPerson> {
-        if (!firstName || firstName.trim() === "") {
+        if (false) {
             throw new Error("First name is required");
         }
killedBy: PersonService should throw an error when first name is empty
statusReason: expected [Function] to throw error including 'First name is required' but got 'First name must be at least 3 charact…'

[Killed] EqualityOperator
src/services/person.service.ts:8:26
         if (!firstName || firstName.trim() === "") {
             throw new Error("First name is required");
         }
-        if (!lastName || lastName.trim() === "") {
+        if (!lastName || lastName.trim() !== "") {
             throw new Error("Last name is required");
         }
killedBy: PersonService should create a person correctly
statusReason: Last name is required

[Killed] BlockStatement
src/services/person.service.ts:8:50
         if (!firstName || firstName.trim() === "") {
             throw new Error("First name is required");
         }
-        if (!lastName || lastName.trim() === "") {
-            throw new Error("Last name is required");
-        }
+        if (!lastName || lastName.trim() === "") {}
         if (firstName.length < 3) {
             throw new Error("First name must be at least 3 characters long");
killedBy: PersonService should throw an error when last name is empty
statusReason: promise resolved "{ firstName: 'John', …(3) }" instead of rejecting

[Killed] EqualityOperator
src/services/person.service.ts:11:13
         if (!lastName || lastName.trim() === "") {
             throw new Error("Last name is required");
         }
-        if (firstName.length < 3) {
+        if (firstName.length >= 3) {
             throw new Error("First name must be at least 3 characters long");
         }
killedBy: PersonService should create a person correctly
statusReason: First name must be at least 3 characters long

[Killed] ConditionalExpression
src/services/person.service.ts:11:13
         if (!lastName || lastName.trim() === "") {
             throw new Error("Last name is required");
         }
-        if (firstName.length < 3) {
+        if (true) {
             throw new Error("First name must be at least 3 characters long");
         }
killedBy: PersonService should create a person correctly
statusReason: First name must be at least 3 characters long

[Killed] BlockStatement
src/services/person.service.ts:14:23
         if (firstName.length < 3) {
             throw new Error("First name must be at least 3 characters long");
         }
-        if (age < 18) {
-            throw new Error("Person must be of legal age");
-        }
+        if (age < 18) {}
 
         const fullName = `${firstName} ${lastName}`;
killedBy: PersonService should throw an error when person is underage
statusReason: promise resolved "{ firstName: 'John', …(3) }" instead of rejecting

[Killed] EqualityOperator
src/services/person.service.ts:14:13
         if (firstName.length < 3) {
             throw new Error("First name must be at least 3 characters long");
         }
-        if (age < 18) {
+        if (age >= 18) {
             throw new Error("Person must be of legal age");
         }
killedBy: PersonService should create a person correctly
statusReason: Person must be of legal age
